"Windows Azure Cloud Storage" = "تخزين Windows Azure السحابي";

/* Azure Login Credentials */
"Storage Account Name" = "اسم حساب التخزين";
"Primary Access Key" = "مفتاح الوصول الأساسي";

"Windows Azure CDN" = "Windows Azure CDN";